load-test-results.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /
Document Length:        28 bytes

Concurrency Level:      50
Time taken for tests:   1.453 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      181000 bytes
HTML transferred:       28000 bytes
Requests per second:    688.43 [#/sec] (mean)
Time per request:       72.629 [ms] (mean)
Time per request:       1.453 [ms] (mean, across all concurrent requests)
Transfer rate:          121.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      0      36
Processing:     3   69  13.1     69      95
Waiting:        3   69  13.2     68      95
Total:         13   70  11.6     70      95

Percentage of the requests served within a certain time (ms)
  50%     70
  66%     74
  75%     75
  80%     77
  90%     84
  95%     89
  98%     91
  99%     93
 100%     95 (longest request)